src/Documents/уатЖурналМедицинскогоОсмотраВодителей/уатЖурналМедицинскогоОсмотраВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатЖурналМедицинскогоОсмотраВодителей</name>
  <basedOn>Document.уатПутевойЛист</basedOn>
  <attributes>
    <name>ВидКонтроля</name>
    <type>
      <types>EnumRef.уатВидыКонтроляТранспортныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Журнал</name>
    <type>
      <types>CatalogRef.уатЖурналыТранспортныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заключение</name>
    <type>
      <types>CatalogRef.уатЗаключенияОРезультатахМедицинскогоОсмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскийРаботник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение организации</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутевойЛист</name>
    <type>
      <types>DocumentRef.уатПутевойЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.уатСтатусы_уэ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РезультатыОсмотра</name>
    <attributes>
      <name>Требование</name>
      <type>
        <types>CatalogRef.уатТребованияКонтроляТС</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>DefinedType.уатТипыЗначенийТребованийКонтроляТСиВодителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.уатСтатусы_уэ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеДанныеСкрыты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Позывной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Добавление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Удаление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/уатЖурналМедицинскогоОсмотраВодителей/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
    ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	//ПодключаемоеОборудование
	уатОбщегоНазначения_проф.НастроитьПодключаемоеОборудование(ЭтотОбъект);
	//Конец ПодключаемоеОборудование
	
	УстановитьОтборПоМедработникуПриОткрытии();
	уатЖурналыТранспортныхДокументов.УстановитьУсловноеОформлениеПолейСтатусов(УсловноеОформление);
	
	флЭЦП               = ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныеПодписи");
	ИспользоватьОбменЭД = ПолучитьФункциональнуюОпцию("ИспользоватьОбменЭД");
	флПравоПодписи      = ПравоДоступа("Изменение",
		Метаданные.Справочники.уатЖурналМедицинскогоОсмотраВодителейПрисоединенныеФайлы);
		
	Элементы.СостояниеПодписи.Видимость               = флЭЦП;
	Элементы.ФормаПодписать.Видимость                 = флЭЦП И флПравоПодписи;
	Элементы.СписокКонтекстноеМенюПодписать.Видимость = флЭЦП И флПравоПодписи;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатДокументФормаСпискаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьБыстрыйОтбор("ВидКонтроля");
	УстановитьБыстрыйОтбор("СостояниеПодписи");
	УстановитьБыстрыйОтбор("МедицинскийРаботник");
	
	//ПодключаемоеОборудование
	уатОбщегоНазначенияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтотОбъект);
	//Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() И ИмяСобытия = "ScanData" Тогда
		уатЖурналыТранспортныхДокументовКлиент.ОбработатьШтрихкод(Параметр, ЭтотОбъект,
			"уатЖурналМедицинскогоОсмотраВодителей");
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "ПриПолученииПодписи" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	// ПодключаемоеОборудование
	уатОбщегоНазначенияКлиент.ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.уатЖурналМедицинскогоОсмотраВодителей") Тогда
		ПоказатьЗначение(Неопределено, ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подписать(Команда)

	Если НЕ уатЗащищенныеФункцииКлиент.ИТСОтраслевой_ПроверкаДоступностиСервисов() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКлючевойОперации = "уатОперации.ПодписаниеЭПЛизЖурналаМедработника";
	ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики(ИмяКлючевойОперации, 1);
	
	Если ИспользоватьОбменЭД Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		мсвДокументы = Новый Массив();
		мсвДокументы.Добавить(ТекущиеДанные.ПутевойЛист);
		
		Если НЕ уатЖурналыТранспортныхДокументов.ПроверитьЧтоПроведенПередПодписью(мсвДокументы) Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("мсвДокументы",  мсвДокументы);
		ПараметрыОткрытия.Вставить("Подпись",       "Медработник");
		ПараметрыОткрытия.Вставить("Представление", "Медработник");
		ОткрытьФорму("Документ.уатПутевойЛист.Форма.ФормаПодписейОтвЛица", ПараметрыОткрытия, ЭтотОбъект);
	Иначе
		ДопПараметры = Новый Структура("ОповеститьОЗавершении", Истина);
		уатЖурналыТранспортныхДокументовКлиент.ПодписатьИзСписка(Элементы.Список, УникальныйИдентификатор, ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЖурнала(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
		
	ПараметрыФормы = Новый Структура;
	Если ТекСтрока <> Неопределено Тогда
		ПараметрыФормы.Вставить("Организация", ТекСтрока.Организация);
		ПараметрыФормы.Вставить("Журнал", ТекСтрока.Журнал);
		ПараметрыФормы.Вставить("ФормироватьПриОткрытии", Истина);
	КонецЕсли;
	ОткрытьФорму("Отчет.уатЖурналМедицинскогоОсмотраВодителей.Форма.ФормаОтчета", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ТестШтрихкода(Команда)
	Оповещ = Новый ОписаниеОповещения("ТестШтрихкодаЗавершение", ЭтотОбъект);
	ПоказатьВводЗначения(Оповещ, "", "Введите штрихкод ПЛ");
КонецПроцедуры

&НаКлиенте
Процедура ТестШтрихкодаЗавершение(Результат, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		ПараметрШтрихкод = Новый Массив;
		ПараметрШтрихкод.Добавить(Результат);
		ПараметрШтрихкод.Добавить(Неопределено);
		
		уатЖурналыТранспортныхДокументовКлиент.ОбработатьШтрихкод(ПараметрШтрихкод, ЭтотОбъект,
			"уатЖурналМедицинскогоОсмотраВодителей");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетРезультаты(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		уатЖурналыТранспортныхДокументовКлиент.ОткрытьОтчетРезультаты(ТекСтрока.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборВидКонтроляПриИзменении(Элемент)
	УстановитьБыстрыйОтбор("ВидКонтроля");
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодписанПриИзменении(Элемент)
	УстановитьБыстрыйОтбор("СостояниеПодписи");
КонецПроцедуры

&НаКлиенте
Процедура ОтборМедработникПриИзменении(Элемент)
	УстановитьБыстрыйОтбор("МедицинскийРаботник");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура УстановитьБыстрыйОтбор(ИмяПоля)
	Если ИмяПоля = "ВидКонтроля" Тогда
		Если ЗначениеЗаполнено(ОтборВидКонтроля) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидКонтроля",
				ОтборВидКонтроля,,, Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидКонтроля",,,, Ложь);
		КонецЕсли;
	ИначеЕсли ИмяПоля = "СостояниеПодписи" Тогда
		Если ОтборПодписан Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "СостояниеПодписи", -1,,, Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "СостояниеПодписи",,,, Ложь);
		КонецЕсли;
	ИначеЕсли ИмяПоля = "МедицинскийРаботник" Тогда
		Если ЗначениеЗаполнено(ОтборМедработник) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "МедицинскийРаботник",
				ОтборМедработник,,, Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "МедицинскийРаботник",,,, Ложь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоМедработникуПриОткрытии()
	Если НЕ уатЖурналыТранспортныхДокументов.ТекущийПользовательМедработник() Тогда
		Возврат;
	КонецЕсли;
	
	ТекПользователь = Пользователи.АвторизованныйПользователь();
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ФизическоеЛицо = &ФизическоеЛицо
	|	И НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.ЭтоГруппа");
	Запрос.УстановитьПараметр("ФизическоеЛицо", ТекПользователь.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОтборМедработник = Выборка.Ссылка;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
